benchmarks/dev/benchmark-scenario.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://testnet-api-app.blockx.network/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      rampTo: 1000
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/"
        - get:
            url: "/ping"
        count: 100